Source : 파이썬 머신러닝 완벽 가이드(권철민, 위키북스)

# Data Handling - Pandas  
> **Pandas**  
파이썬에서 데이터 핸들링을 가능하게 해주는 가장 인기 있는 라이브러리

> **DataFrame**  
DataFrame은 Pandas의 핵심 객체, DataFrame은 여러 개의 행과 열로 이루어진 2차원 데이터를 담는 데이터 구조체

> **Index**  
RDBMS의 PK처럼 개별 데이터를 고유하게 식별하는 Key 값

> **Series**  
칼럼이 하나뿐인 데이터 구조체  
(cf) DataFrame은 칼럼이 여러 개인 데이터 구조체

## 1. 파일을 DataFrame으로 로딩, 판다스 기본 API  

### 1-1. 데이터 다운로드  
Kaggle에서 타이타닉 탑승자 데이터 파일 내려받기  
https://www.kaggle.com/c/titanic/data  
train.csv를 Jupyter Notebook의 디렉터리로 titanic_train.csv라는 파일명으로 변경해서 내려받기

### 1-2. DataFrame으로 로딩, 기본 정보 확인
- **pd.read_csv(filepath, [sep=','])**  
: 호출 시 파일명 인자로 들어온 파일을 로딩해 DataFrame 객체로 반환  
별다른 파라미터 지정이 없을 경우 파일의 맨 처음 로우를 칼럼명으로 인지해서 칼럼으로 변환하며, 콤마로 분리된 데이터값들이 해당 칼럼에 맞게 할당됨  
  - filepath : 로드하려는 데이터 파일의 경로를 포함한 파일명 입력  
  - sep : 필드 구분 문자, default값은 콤마(`,`)로 할당됨  

- **DataFrame.head()**  
: DataFrame의 맨 앞에 있는 N개의 로우 반환, default는 5개  

- **DataFrame.shape**  
: DataFrame의 행과 열을 튜플 형태로 반환  

- **DataFrame.info()**  
: 총 데이터 건수(전체 row 수, column 수), 칼럼별 데이터 타입, Null 건수, 전체 칼럼의 타입 요약 등을 알려주는 메서드  

- **DataFrame.describe()**  
: 숫자 형 칼럼에 대한 개략적인 데이터 분포도를 확인 -> 머신러닝 성능 향상시키는 중요한 요소  
  - count : Not Null인 데이터 건수  
  - mean : 전체 데이터의 평균값  
  - std : 표준편차  
  - min : 최솟값
  - max : 최댓값
  - n-percentile : 25/50/75 percentile 값  

- **DataFrame['칼럼명']**  
: Series 형태로 특정 칼럼 데이터 세트가 반환됨

- **DataFrame['칼럼명'].value_counts()**  
: 해당 칼럼값의 유형과 건수를 반환, 데이터의 분포도를 확인하는 데 매우 유용한 함수  
Series 객체만 value_counts() 메서드를 가짐

In [ ]:
import pandas as pd

# 타이타닉 탐승자 데이터를 DataFrame으로 로딩
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic_df 변수 type:', type(titanic_df))
titanic_df

titanic_df 변수 type: <class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
# DataFrame의 맨 앞 3개의 로우를 반환
titanic_df.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [ ]:
# DataFrame의 행과 열 크기 알아보기
titanic_df.shape

(891, 12)

In [ ]:
# 총 데이터 건수, 데이터 타입, Null 개수 등을 확인
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# 숫자 형 칼럼에 대한 개략적인 데이터 분포도 확인
titanic_df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
# 숫자형 카테고리 칼럼인 Pclass 칼럼 데이터 값의 유형과 건수 확인
titanic_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

### 명칭(label) 기반 인덱싱과 위치(position) 기반 인덱싱의 구분

In [ ]:
#간단히 DataFrame 생성

In [ ]:
import pandas as pd

In [ ]:
data = {'Name': ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [ ]:
#data_df를 reset_index()로 새로운 숫자형 인덱스를 생성
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})
data_df_reset

  old_index      Name  Year  Gender
0       one   Chulmin  2011    Male
1       two  Eunkyung  2016  Female
2     three  Jinwoong  2015    Male
3      four   Soobeom  2015    Male

In [ ]:
#인덱스 값에 1을 더해서 1부터 시작하는 새로운 인덱스값 생성
data_df_reset.index = data_df_reset.index + 1
data_df_reset

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

### DataFrame iloc[ ] 연산자

- **iloc[ ]은 위치 기반 인덱싱만 허용**  
행과 열 값으로 integer 또는 integer 형의 슬라이싱, 팬시 리스트 값을 입력  
불린 인덱싱은 제공하지 않음

In [ ]:
#data_df에서 첫 번째 행, 첫 번째 열의 데이터 추출하기

In [ ]:
data_df.iloc[0,0]

'Chulmin'


- iloc[ ]에 위치 인덱싱이 아닌 명칭을 입력하면 오류 발생

In [ ]:
#data_df.iloc[0, 'Name']

- iloc[ ]에 문자열 인덱스를 행 위치에 입력해도 오류 발생

In [ ]:
#data_df.iloc['one', 0]

In [ ]:
#data_df_reset에서 iloc[0,1] 적용하기

In [ ]:
data_df_reset.iloc[0,1] #첫 번째 행, 두 번째 열 위치에 있는 값을 반환함

'Chulmin'

### DataFrame loc[ ] 연산자

- **loc[ ]은 명칭 기반으로 데이터를 추출**  
행 위치에는 DataFrame index 값을, 열 위치에는 칼럼 명을 입력

In [ ]:
#인덱스 값이 'one'인 행의 칼럼 명이 'name'인 데이터 추출

In [ ]:
data_df.loc['one', 'Name']

'Chulmin'

In [ ]:
#인덱스 값이 정수형인 경우

In [ ]:
data_df_reset.loc[1, 'Name']

'Chulmin'

In [ ]:
#data_df.loc[0, 'Name']은 오류 발생 : 인덱스값이 0인 행이 없기 때문


- loc[시작 값:종료 값] 슬라이싱을 적용하면 시작 값 ~ 종료 값까지 포함하는 것을 의미  
명칭 기반 인덱싱의 특성 때문

In [ ]:
print('명칭 기반 loc slicing\n', data_df.loc['one':'two', 'Name'])

명칭 기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [ ]:
print(data_df_reset.loc[1:2, 'Name']) #인덱스가 1,2인 2개의 데이터 반환

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

### 불린 인덱싱

불린 인덱싱으로 처음부터 가져올 조건을 입력하면 자동으로 원하는 값을 필터링함  
[ ], ix[ ], loc[ ]에서 지원

In [ ]:
#승객 중 나이(Age)가 60세 초과인 데이터 추출하기

In [ ]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [ ]:
#60세가 넘는 승객의 이름과 나이만 추출하기

In [ ]:
titanic_df[titanic_df['Age']>60][['Name', 'Age']]

                                          Name   Age
33                       Wheadon, Mr. Edward H  66.0
54              Ostby, Mr. Engelhart Cornelius  65.0
96                   Goldschmidt, Mr. George B  71.0
116                       Connors, Mr. Patrick  70.5
170                  Van der hoef, Mr. Wyckoff  61.0
252                  Stead, Mr. William Thomas  62.0
275          Andrews, Miss. Kornelia Theodosia  63.0
280                           Duane, Mr. Frank  65.0
326                  Nysveen, Mr. Johan Hansen  61.0
438                          Fortune, Mr. Mark  64.0
456                  Millet, Mr. Francis Davis  65.0
483                     Turkula, Mrs. (Hedwig)  63.0
493                    Artagaveytia, Mr. Ramon  71.0
545               Nicholson, Mr. Arthur Ernest  64.0
555                         Wright, Mr. George  62.0
570                         Harris, Mr. George  62.0
625                      Sutton, Mr. Frederick  61.0
630       Barkworth, Mr. Algernon Henry Wilson  80.0
672                Mitchell, Mr. Henry Michael  70.0
745               Crosby, Capt. Edward Gifford  70.0
829  Stone, Mrs. George Nelson (Martha Evelyn)  62.0
851                        Svensson, Mr. Johan  74.0

In [ ]:
#loc을 이용해서 동일한 결과 출력하기

In [ ]:
titanic_df.loc[titanic_df['Age']>60, ['Name', 'Age']]

                                          Name   Age
33                       Wheadon, Mr. Edward H  66.0
54              Ostby, Mr. Engelhart Cornelius  65.0
96                   Goldschmidt, Mr. George B  71.0
116                       Connors, Mr. Patrick  70.5
170                  Van der hoef, Mr. Wyckoff  61.0
252                  Stead, Mr. William Thomas  62.0
275          Andrews, Miss. Kornelia Theodosia  63.0
280                           Duane, Mr. Frank  65.0
326                  Nysveen, Mr. Johan Hansen  61.0
438                          Fortune, Mr. Mark  64.0
456                  Millet, Mr. Francis Davis  65.0
483                     Turkula, Mrs. (Hedwig)  63.0
493                    Artagaveytia, Mr. Ramon  71.0
545               Nicholson, Mr. Arthur Ernest  64.0
555                         Wright, Mr. George  62.0
570                         Harris, Mr. George  62.0
625                      Sutton, Mr. Frederick  61.0
630       Barkworth, Mr. Algernon Henry Wilson  80.0
672                Mitchell, Mr. Henry Michael  70.0
745               Crosby, Capt. Edward Gifford  70.0
829  Stone, Mrs. George Nelson (Martha Evelyn)  62.0
851                        Svensson, Mr. Johan  74.0


- 여러 개의 복합 조건을 결합해 적용하기 : 개별 조건은 ( )로 묶고, 복합 조건 연산자를 사용한다.
1. and 조건일 때는 &
2. or 조건일 때는 |
3. Not 조건일 때는 ~

In [ ]:
#나이가 60세를 넘고, 선실 등급이 1등급이며, 성별이 여성인 승객 추출하기

In [ ]:
titanic_df[(titanic_df['Age']>60)&(titanic_df['Pclass']==1)&(titanic_df['Sex']=='female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [ ]:
#개별 조건을 변수에 할당하고 이들 변수를 결합해서 불린 인덱싱 수행하기

In [ ]:
cond1 = titanic_df['Age']>60
cond2 = titanic_df['Pclass']==1
cond3 = titanic_df['Sex']=='female'
titanic_df[cond1&cond2&cond3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

## 정렬, Aggregation 함수, GroupBy 적용

### DataFrame, Series의 정렬 - sort_values()

- sort_values()는 RDBMS SQL의 order by 키워드와 매우 유사함  
주요 입력 파라미터 : by, ascending, inplace  
by=['칼럼명'] : 해당 칼럼으로 정렬 수행, 여러 개의 칼럼으로 정렬하려면 리스트 형식으로 정렬하려는 칼럼명을 입력  
ascending=True : Default값, 오름차순 정렬  
ascending=False : 내림차순 정렬  
inplace=False : Default값, sort_values()를 호출한 DataFrame은 그대로 유지하며 정렬된 DataFrame을 반환  
inplace=True : 호출한 DataFrame의 정렬 결과를 그대로 적용함

In [ ]:
#Name 칼럼으로 오름차순 정렬해 반환

In [ ]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

In [ ]:
#Pclass, Name 칼럼으로 내림차순 정렬한 결과를 반환

In [ ]:
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5,NaN,S

### Aggregation 함수 적용

DataFrame에서 min(), max(), sum(), count()와 같은 aggregation 함수를 호출하면 모든 칼럼에 해당 aggregation을 적용한다.

In [ ]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64


특정 칼럼에 aggregation 함수를 적용하기 위해서는 DataFrame에 대상 칼럼들만 추출해서 적용한다.

In [ ]:
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

### groupby( ) 적용

DataFrame의 groupby( ) 사용 시 입력 파라미터 by에 칼럼을 입력하면 대상 칼럼으로 groupby된다.  
이때, DataFrameGroupBy라는 또 다른 형태의 DataFrame을 반환한다.

In [ ]:
#Pclass 칼럼 기준으로 GroupBy된 DataFrameGroupBy 객체 반환하기

In [ ]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>


DataFrame의 groupby()에 aggregation 함수를 호출하면 groupby() 대상 칼럼을 제외한 모든 칼럼에 해당 aggregation 함수를 적용한다.

In [ ]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491


DataFrame의 groupby()에 특정 칼럼만 aggregation 함수를 적용하려면 groupby()로 반환된 객체에 해당 칼럼을 필터링한 뒤 aggregation 함수를 적용한다.

In [ ]:
#Pclass로 groupby()하고, PassengerId, Survived 칼럼에만 count() 수행하기

In [ ]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491


DataFrame의 groupby()에 서로 다른 aggregation 함수를 적용할 경우에는 DataFrameGroupBy 객체의 agg( ) 내에 인자로 입력해서 사용한다.

In [ ]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42


여러 개의 칼럼이 서로 다른 aggregation 함수를 groupby에서 호출하려면 agg( ) 내에 입력 값으로 딕셔너리 형태 {'aggregation이 적용될 칼럼': 'aggregation 함수'}를 입력한다.

In [ ]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

## 결손 데이터 처리하기

- 결손 데이터 : 칼럼에 값이 없는(Null)인 경우를 의미하며, 이를 넘파이의 **NaN**으로 표시한다.  
기본적으로 Machine Learning은 NaN 값을 처리하지 않고, 평균, 총합 등의 함수 연산에서도 제외되므로 이 Nan 값을 다른 값으로 대체해야 한다.  
- **isna( ) : NaN 여부를 확인하는 API**  
- **fillna( ) : NaN 값을 다른 값으로 대체하는 API**

### isna( )로 결손 데이터 여부 확인

- isna( )는 데이터가 NaN인지 아닌지를 알려준다.

DataFrame에 isna() 수행 시 모든 칼럼의 값에 대한 NaN 여부를 True, False로 알려준다.

In [ ]:
titanic_df.isna().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

In [ ]:
#isna() 결과에 sum() 함수를 추가해서 결손 데이터의 개수 구하기

In [ ]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### fillna( )로 결손 데이터 대체하기

- fillna( )로 결손 데이터(NaN)를 다른 값으로 대체할 수 있다.
- **fillna()를 이용해 반환 값을 다시 받거나, inplace=True 파라미터를 추가해야 실제 데이터 세트 값이 변경된다.**

In [ ]:
#'Cabin' 칼럼의 NaN값을 'C000'으로 대체하기

In [ ]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000') #fillna() 반환 값을 다시 받기
#titanic_df['Cabin'].fillna('C000', inplace=True)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S

In [ ]:
#'Age' 칼럼의 NaN 값을 평균 나이로, 'Embarked' 칼럼의 NaN값을 'S'로 대체해 모든 결손 데이터를 처리하기

In [ ]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

## apply lambda 식으로 데이터 가공

복잡한 데이터의 가공이 필요한 경우 apply lambda를 이용한다.

- **lambda식**  
lambda 입력 인자 : 입력 인자의 계산식  
':'로 입력 인자와 반환될 입력 인자의 계산식을 분리한다.  
(예시) lambda x : x ** 2

In [ ]:
def get_square(a):
    return a ** 2

print('3의 제곱은: ', get_square(3))

3의 제곱은:  9

In [ ]:
lambda_square = lambda x : x ** 2
print('3의 제곱은: ', lambda_square(3))

3의 제곱은:  9

- 여러 개의 값을 입력 인자로 사용해야 할 경우에는 map( ) 함수를 결합해서 사용한다.

In [ ]:
a = [1, 2, 3]
squares = map(lambda x : x ** 2, a)
list(squares)

[1, 4, 9]

- DataFrame의 lambda식은 파이썬의 lambda식을 그대로 적용한 것  
- DataFrame.apply(lambda식)

In [ ]:
#'Name' 칼럼의 문자열 개수를 별도의 칼럼인 'Name_len'에 생성하기

In [ ]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

In [ ]:
#lambda식에서 if else 절을 사용해서 나이가 15세 이하면 'Child', 그렇지 않으면 'Adult'로 구분하기

In [ ]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <= 15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(10)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child
8  27.000000       Adult
9  14.000000       Child


lambda식에서는 elif를 지원하지 않는다.  
조건식을 여러 개 사용하는 경우 else절을 ( )로 내포해 ( ) 내에서 다시 if, else를 적용해 사용한다.

In [ ]:
#나이가 15세 이하이면 Child, 15 ~ 60세 사이는 Adult, 61세 이상은 Elderly로 분류하는 'Age_Cat' 칼럼 만들기

In [ ]:
titanic_df['Age_Cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x <= 15 else('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_Cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_Cat, dtype: int64


조건식이 많을 때에는 별도의 함수를 만든다.

In [ ]:
#5살 이하는 Baby, 12살 이하는 Child, 18살 이하는 Teenage, 25살 이하는 Student,
#35살 이하는 Young Adult, 60세 이하는 Adult, 그 이상은 Elderly로 분류하기

In [ ]:
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: 'Elderly'
    return cat

#lambda식에서 위에서 생성한 get_category()함수를 반환값으로 지정
#get_category()함수는 입력값으로 'Age' 칼럼 값을 받아서 해당하는 cat으로 반환함

titanic_df['Age_Cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_Cat']].head()

    Age      Age_Cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult